Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>LhHY8K8NPp7NJVie2ThxlohRSZOI9JWFCQushzvDPRo51zs+s+c+4BV78V4D0ZhqZ2gmR2U7Dh+z&#13;
1j9lkxQfQXtyoBQtS8uCOOpSFTQdfO55SCXgqk9JHZwFzp8rn4dMnQ61IGOnk+kCUFa0d4vLPAMG&#13;
hlu3Yd2RL3rJJX5ncyg=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>PWf9W4cWcVTo4//Jew+yN/q51u9UA4uia5HM2viCulJXZ9ZQSYVnfTESt078u9wCJRhCySq/On9z&#13;
HlQ+oUU89gAfTnFAGAW5m94UrrKQUTH43fMErXqEki3jLpx1iKx1hDZU8vjaADfgbRTYjMpYZ6Za&#13;
c0STinVzY6nyXWmrRsjeOIy/1T7wVySG4UBwa94wGNlcS1gsn/YeJyP3Fht2Zyy81sPpS2oNZQtP&#13;
J3byXeQn1Io7+jwYBgmqT7iBCdLkifuSou6yFGR+koSTWxEE94DFhnwPuh0QoV5oll8c86CsMPCW&#13;
1iLKdVKkcvdjhOjOYa/rYCg2uqovYynfxB9T+yMHGWiocyT27RA/5QcOjks7AyC4OhfD8ExywB+V&#13;
RGqI7JjaIPxV3sfsuI4nrx05mrCaG5ZXzPAf0C2Wowg6WxlpxSGsNDtS3SkcLGeUUbKo6vmeDG4j&#13;
u0+/OjoopqM1V0KAbO8H2evLf19zSKsIivUlxrlrTi/kyXWG0epqTHgil3ZpIWyJeAOQDbINfxYp&#13;
dVhxRCdnX7hDo6tfWPdVyEd8xDxgvlbElxPxlHfti0mnOB37w2WRbyK1PZX3qVEmpmypXQq1Xfqh&#13;
MaHGpkTBA4UI6Fa8MAmYQ9Nd8wYM92R9QQxuHZHsG9nTnzOvPpQcBAdDjNM6CwTkP8W+rmhfjJ0G&#13;
KVDwnvMg2MUTAipH61C46rTq133DFtv2YzbP62JQwRPPk0tb76FTdODYsD0ljhFj+yktA5rDGBN1&#13;
BQVkIoRJgctMW0T//6hnbFmf0V9QNeq05o0RqczhPh6e9fj9GPXFzIGpK4ee+pogwkMpTFGzc67t&#13;
2NR0gz9wUlBdwnz2ODMut/fQ0WXLFNf5pYQiWAbfUCm3NuBJg49OU/WxCOQKwNjkrSZna78O3lpV&#13;
jevRuCIkBBQxM5vXZFQpcIH7VX+2SAD2MjnBFRiOxWx3WLX4</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>10IxEb89QZI+wNybEIDF7hzyNdI=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
STM1wA8hvjOCYzY0UjI4BzlqaZp5Y6rx9IJVnxKawTiCWkSRaCA+wGqiEuhYOFIa/w3/bj7It2Ik&#13;
zcGpKOObe+0s+SYUdGkS8KT5NdSrwiHDwIuXwb4xOw2HJKgGZVCtVTuETP67pZFDm1H/WO0fCvGJ&#13;
RPxXLg8zHE0Tg5ogh8E=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>